<!-- dflook/terraform-github-actions {"workspace":"default","backend":"80844cbe6c96314f0b59cd74f33aeac1b395dad8013000220b4692999c1175ef","backend_type":"s3","plan_job_ref":"Job Terraform plan #2 at https://github.com/Thomas-mcinally/Kraken-DCA/actions/runs/3402694575","plan_hash":"c7d3f60ddb8bb2ef5ce1e051662214c70c449e6aab1f2295f883fc6b39a73c10","plan_text_format":"text"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.kraken-dca-lambda will be updated in-place
  ~ resource "aws_lambda_function" "kraken-dca-lambda" {
        id                             = "kraken-dca-lambda"
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies:61",
        ] -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.kraken-withdraw-lambda will be updated in-place
  ~ resource "aws_lambda_function" "kraken-withdraw-lambda" {
        id                             = "kraken-withdraw-lambda"
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies:61",
        ] -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.kraken_dca_dependencies must be replaced
-/+ resource "aws_lambda_layer_version" "kraken_dca_dependencies" {
      ~ arn                         = "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies:61" -> (known after apply)
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [] -> null
      ~ created_date                = "2022-11-06T02:16:56.792+0000" -> (known after apply)
      ~ id                          = "**********************************************************************" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "zFFuHIf2P9N+wTtVSoL511HYE+1pPUKJ1Vn6N1gWTxo=" -> "HV8gg6QbNk3aQegT+ULdA33kj5uTz43L6dbbfbMXB6Q=" # forces replacement
      ~ source_code_size            = 11593566 -> (known after apply)
      ~ version                     = "61" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #2](https://github.com/Thomas-mcinally/Kraken-DCA/actions/runs/3402694575)